In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [17]:
employee1 = pd.read_csv(r'C:\Users\Laptop EDG\Downloads\HW5\employee_01.csv',header=None)
employee1.head(7)

   0      1      2    3
0  1    Joe  70000    3
1  2  Henry  80000    4
2  3    Sam  60000  NaN
3  4    Max  90000

In [18]:
employee1.columns=['Id','Name','Salary','ManagerId']
employee1

   Id   Name  Salary ManagerId
0   1    Joe   70000         3
1   2  Henry   80000         4
2   3    Sam   60000       NaN
3   4    Max   90000